import numpy as np

n = 7

t = np.zeros(n)
t[0] = -0.94910791
t[1] = -0.74153119
t[2] = -0.40584515
t[3] = 0
t[6] = 0.94910791
t[5] = 0.74153119
t[4] = 0.40584515

A = np.zeros(n)
A[0] = A[6] = 0.12948496
A[1] = A[5] = 0.27970540
A[2] = A[4] = 0.38183006
A[3] = 0.41795918


def f(x):
    return (x / 2 + 1) * np.sin(x / 2)
    #return [1] * len(x)


a, b = 1, 2

x = ((b + a) / 2) + (((b - a) / 2) * t)

res = ((b - a) / 2) * sum(A * f(x))

print(f"для отрезка [{a}, {b}]")

print(f"Квадратура Гаусса: {res}")
